xiaqinzhan/RemoteAudioServer/firmware/remote_audio_node/sdkconfig.defaults
# ====================================================================
# sdkconfig.defaults —— 立创实战派 ESP32-S3 (LCKFB SZPI)
# 板载模组 ESP32-S3-WROOM-1 N16R8（16MB Flash / 8MB Octal PSRAM）
# 首次 idf.py set-target esp32s3 后会基于本文件生成 sdkconfig
#
# 首次 idf.py build 会按 main/idf_component.yml 自动下载托管组件
# （78/esp-opus、espressif/es7210、espressif/esp_websocket_client），
# 需要能访问 components.espressif.com，请保持网络通畅。
# ====================================================================

# ---- 目标芯片 ----
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash / PSRAM ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# 八线 PSRAM (N16R8 模组为 Octal SPI PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# ---- CPU / FreeRTOS ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# ---- 分区表 ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- FATFS (SD 卡长文件名) ----
CONFIG_FATFS_LFN_STACK=y
CONFIG_FATFS_CODEPAGE=936
CONFIG_FATFS_MAX_LFN=127

# ---- 应用主任务栈 ----
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---- 日志 ----
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ---- 本工程可选外设开关 ----
# 实战派 S3 板上没有 SSD1306 OLED（I2C 未接线），保持关闭
CONFIG_RAN_ENABLE_OLED=n
# 说明：原来还有一个 CONFIG_RAN_ENABLE_I2S_TX（I2S 播放占位通道，默认开），
# 已随占位代码一起删除 —— 它用 I2S_NUM_1 却复用 I2S0 的 BCLK/WS 引脚，
# 会让录音直接失去时钟。

# ---- WiFi / LWIP 稳定性 ----
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_SO_REUSE=y

# ---- SNTP 时间同步 ----
CONFIG_LWIP_DHCP_GET_NTP_SRV=y

# ---- 服务器（默认连扣子云上部署的 remoteAudioServer）----
# 自动连接 wss://remoteaudio.coze.site:443/ws/device/<device_id>
# 想改连局域网里自己跑的 uvicorn：HOST 填电脑 IP、PORT 填 8000、USE_TLS 改 n
CONFIG_RAN_SERVER_HOST="remoteaudio.coze.site"
CONFIG_RAN_SERVER_PORT=443
CONFIG_RAN_SERVER_USE_TLS=y
# wss 证书校验依赖内置 CA bundle（IDF 默认已开，这里显式声明）
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# ---- WebSocket 握手响应头缓冲 ----
# Coze 网关（Tengine + 字节 FaaS 网关）回的 101 响应头约 980 字节：
# X-Tt-Trace-Host 一条就 352 字节，另有 X-Tt-Trace-Id / x-tt-logid / EagleId / Via /
# X-Faas-Gateway-Instance-Name 等。IDF 的 ws 传输层用同一块 CONFIG_WS_BUFFER_SIZE
# 缓冲先拼 Upgrade 请求、再累积读响应头，默认 1024 不够，会报
# transport_ws: Header size exceeded buffer size 并握手失败。
# 菜单路径：Component config -> TCP Transport -> Websocket -> Websocket transport buffer size
CONFIG_WS_BUFFER_SIZE=4096
